=====================================
Call identifier with literal argument
=====================================

f 1

---

(source_file
  (call_expression
    callee: (identifier)
    arguments: (number)))

=======================================
Call identifier with multiple arguments
=======================================

f 1 2 3

---

(source_file
  (call_expression
    callee: (identifier)
    arguments: (number)
    arguments: (number)
    arguments: (number)))

==================================
Call function with expression args
==================================

f (f 1)

---

(source_file
  (call_expression
    callee: (identifier)
    arguments: (call_expression
      callee: (identifier)
      arguments: (number))))

=============================================
Call expression where callee is an expression
=============================================

(f 1) 2 3

---

(source_file
  (call_expression
    callee: (call_expression
      callee: (identifier)
      arguments: (number))
    arguments: (number)
    arguments: (number)))
