=========
Booleans
=========

first = true
second = false

---

(source_file
  (constant
    identifier: (identifier)
    value: (boolean))
  (constant
    identifier: (identifier)
    value: (boolean)))

========
Numbers
========

first = 1234567890
second = 1.0
third = 0.0000
fourth = 111.0

---

; Decimal points must be surrounded by at least one digit.
(source_file
  (constant
    identifier: (identifier)
    value: (number))
  (constant
    identifier: (identifier)
    value: (number))
  (constant
    identifier: (identifier)
    value: (number))
  (constant
    identifier: (identifier)
    value: (number)))

========
Strings
========

empty = ""
single = "a"
multiple = "with content"
weird = "with-!@#$%^&*()?/|{}[]`~'<>:;,.symbols"

---

(source_file
  (constant
    identifier: (identifier)
    value: (string))
  (constant
    identifier: (identifier)
    value: (string
      (string_fragment)))
  (constant
    identifier: (identifier)
    value: (string
      (string_fragment)))
  (constant
    identifier: (identifier)
    value: (string
      (string_fragment))))

=====================================
Strings with simple escape sequences
=====================================

newline = "\n"
carriage_return = "\r"
tab = "\t"
backslash = "\\"
double_quote = "\""
surrounded = "with \"surrounding\" quotes"

---

(source_file
  (constant
    identifier: (identifier)
    value: (string
      (escape_sequence)))
  (constant
    identifier: (identifier)
    value: (string
      (escape_sequence)))
  (constant
    identifier: (identifier)
    value: (string
      (escape_sequence)))
  (constant
    identifier: (identifier)
    value: (string
      (escape_sequence)))
  (constant
    identifier: (identifier)
    value: (string
      (escape_sequence)))
  (constant
    identifier: (identifier)
    value: (string
      (string_fragment)
      (escape_sequence)
      (string_fragment)
      (escape_sequence)
      (string_fragment))))

=======
Tuples
=======

unit = ()
double = (0, x)
triple = (5, "string", true)

---

(source_file
  (constant
    identifier: (identifier)
    value: (tuple))
  (constant
    identifier: (identifier)
    value: (tuple
      elements: (number)
      elements: (identifier)))
  (constant
    identifier: (identifier)
    value: (tuple
      elements: (number)
      elements: (string
        (string_fragment))
      elements: (boolean))))

==============
Nested tuples
==============

nested = (0, (1, 2), (3, (4, 5)))

-----

(source_file
  (constant
    identifier: (identifier)
    value: (tuple
      elements: (number)
      elements: (tuple
        elements: (number)
        elements: (number))
      elements: (tuple
        elements: (number)
        elements: (tuple
          elements: (number)
          elements: (number))))))
